# FontColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyleOverrideOptions..::..FontColor Property
TableCellStyleOverrideOptions Class See Also
---
Indicates if the font color characteristic is overridden.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool FontColor { get; set; }
```

Visual Basic
---
```text
Public Property FontColor As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool FontColor {
	bool get ();
	void set (bool value);
}
```

# See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace